; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared0 - mode
	thermograph2 - mode
	thermograph1 - mode
	spectrograph4 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star3 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Planet6 thermograph1)
	(have_image Phenomenon7 spectrograph4)
	(have_image Star8 spectrograph3)
	(have_image Phenomenon9 thermograph1)
	(have_image Planet10 spectrograph4)
	(have_image Star11 spectrograph4)
	(have_image Phenomenon12 thermograph2)
	(have_image Star13 thermograph1)
	(have_image Star14 thermograph1)
	(have_image Planet15 thermograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
2. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 11
3. (turn_to satellite0 star11 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star11)
   goals met: 0 of 11
4. (take_image satellite0 star11 instrument0 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 1 of 11
5. (turn_to satellite0 planet15 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet15)
   goals met: 1 of 11
6. (take_image satellite0 planet15 instrument0 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 2 of 11
7. (turn_to satellite0 planet10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet10)
   goals met: 2 of 11
8. (take_image satellite0 planet10 instrument0 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 3 of 11
9. (turn_to satellite0 phenomenon7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 11
10. (take_image satellite0 phenomenon7 instrument0 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 4 of 11
11. (turn_to satellite0 phenomenon12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 11
12. (take_image satellite0 phenomenon12 instrument0 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 5 of 11
13. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 11
14. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 11
15. (turn_to satellite0 groundstation2 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation2)
   goals met: 5 of 11
16. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 5 of 11
17. (turn_to satellite0 phenomenon9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 11
18. (take_image satellite0 phenomenon9 instrument1 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 6 of 11
19. (turn_to satellite0 planet6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet6)
   goals met: 6 of 11
20. (take_image satellite0 planet6 instrument1 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 7 of 11
21. (turn_to satellite0 star13 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star13)
   goals met: 7 of 11
22. (take_image satellite0 star13 instrument1 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 8 of 11
23. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 8 of 11
24. (take_image satellite0 star14 instrument1 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 9 of 11
25. (turn_to satellite0 star8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star8)
   goals met: 9 of 11
26. (take_image satellite0 star8 instrument1 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 10 of 11
27. (turn_to satellite0 groundstation0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation0)
   goals met: 11 of 11
